{
  "name": "It Really is a Whole New Game",
  "description": "Welcome to the Stone Age.  Let\u0027s discover Bronze! And Machinery!! \n\nAnd maybe one should make a giant notepad of where all these useless striped rocks were...",
  "quests": [
    {
	  "name": "Gleaning and Foraging",
	  "description": "You have likely just arrived in this world at a crossroads. Please be polite and let the roads lie for travelers that come after. Use the clearcut verge to pick up (right-click) sticks and rocks. Some of those rocks will be useful Flint or Meteorites; most rocks are indicators of a large ore deposit below. \n\n Remember: GT6 tools always have a single handle piece, so you can make a flint axe or knife in-hand. \n\n If you haven\u0027t struck coal or lignite, dry grass is your best early torch material.",
	  "x": 160,
	  "y": 100,
	  "icon": {
	    "id": "minecraft:flint"
	  },
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Flint napping",
		  "longDescription": "Your earliest tools will be made of flint and sticks. While digging in the gravel road edge gets some, rocks could also be flint. Sticks appear lying on the ground too, but Greggy tree leaves also drop some sticks along with their saplings and / or fruit. ",
		  "items": [
		    {
			  "item": {
			    "id": "minecraft:flint"
			  }
			},
			{
			  "item": {
			    "id": "minecraft:stick"
			  },
			  "required": 3
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Tinder",
		  "longDescription": "Use a knife or sword to harvest tall grass, bale it up; and place it out in the warm sunshine to wait for dry grass. Alternately, right-click on a non-rotten log with an axe to get bark pieces instead. Either will work with in a two-stick fire drill. It\u0027s the crappiest fire starter, but you need one of some kind to make a common stone cooking furnace. \n N.B. Very few metals can be smelted in so crude an oven!",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.randomtools",
				"damage": 5014
			  },
			  "precision": "ORE_DICTIONARY"
			},
			{
			  "item": {
			    "id": "minecraft:furnace"
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.block.bale.grass",
		  "damage": 1,
		  "amount": 4
		},
		{
		  "id": "minecraft:flint",
		  "amount": 4
		}
	  ]
	},
    {
      "name": "Mind the Splinters",
      "description": "Punching trees! Getting wood! Excitement preparations! Logs only give 2 planks now, however, and planks only make 2 sticks. Both recipes will be greatly improved by using tools, and then machines.",
      "x": 200,
      "y": 15,
      "icon": {
        "id": "minecraft:log"
      },
      "tasks": [
        {
          "type": "DETECT",
          "description": "Get 16 Wood Logs",
          "longDescription": "While Gregtech6 is way different than normal, it isn\u0027t so different that you don\u0027t need to punch trees to start out with. Get 16 wooden logs! Any type will work.",
          "items": [
            {
              "item": {
                "id": "minecraft:log"
              },
              "required": 16,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "gregtech:gt.metatool.01",
		  "damage": 2,
		  "nbt":"{GT.ToolStats: {a: 8002s, c: 8221s, j: 4800s}}"
        }
      ]
    },
    {
      "name": "Baking Bad",
      "description": "A Coke Oven is integral to Gregtech, Immersive Engineering, and Railcraft mostly because of the Creosote it produces. The Coal Coke doesn\u0027t hurt either. It might be good to automate this fairly quickly. \n\n The IE one is slightly more expensive than the RC oven, but has bonus creosote from coal blocks and a chance of bonus coke. The GT coke oven requires iron and is only half the speed but gives massive bonuses for using specific logs; it is also the only one that can handle crushed coal ore, lignite, or oilshale.",
      "x": 250,
      "y": 100,
      "icon": {
        "id": "gregtech:gt.multitileentity",
        "damage": 17000
      },
	  "prerequisites": [
	    "Gleaning and Foraging"
	  ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Collect Coal Coke",
          "longDescription": "Put regular Coal into the left side, give it 90 (or 180) seconds, and it turns into 500mB (half a bucket) of Creosote Oil and 1 Coal Coke.",
          "items": [
            {
              "item": {
                "id": "ImmersiveEngineering:material",
                "damage": 6
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "rewardchoice": [
        {
          "id": "ImmersiveEngineering:fluidContainers",
          "amount": 8
        },
        {
          "id": "ImmersiveEngineering:stoneDecoration",
          "damage": 3
        }
      ]
    },
	{
	  "name": "Stop. It\u0027s Time",
	  "description": "The most pivotal pre-industrial tool in Gregtech: a Hammer. It Crushes, it flattens, it detects ore behind walls!\n\nStriped ore sample rocks cannot be used to make tools, but they do tell where large veins of material are below. \n\n Your reward of GtDynamite has a tiny explosion range, which is directed solidly into the wall; it also requires lighting with a firestarter, but does have Fortune level II as it drops everything.",
	  "x": 108,
	  "y": 75,
	  "icon": {
	    "id": "gregtech:gt.metatool.01",
	    "damage": 12,
		"nbt": "{GT.ToolStats: {a:8500s, c:8221s, j:1600s}}"
	  },
	  "tasks": [
	    {
	    "type": "CRAFT",
		"description": "rocks, fundamental gleaning",
		"longDescription": "You\u0027re first Hard Hammer will definitely be made of stone, and break quickly. You should be able to find six rocks of the same type of non-ore stone lying about during the first day. If not, you can make a cheap flint or vanilla pickaxe; mine some cobble; craft a stone Club. The Club acts like a hammer to crush (re-mine) cobblestone into rocks, but it\u0027s crudeness makes it more weapon than tool.",
		"items": [
		  {
		    "item": {
			  "id": "gregtech:gt.metatool.01",
			  "damage": 12,
			  "nbt": "{GT.ToolStats: {a:8500s, c:8221s, j:1600s}}"
			},
			"precision": "NBT_FUZZY"
		  }
		]
		},
		{
		  "type": "DETECT",
		  "description": "Show those Ores",
		  "longDescription": "Mining ore blocks with the Hammer (or Club) produces crushed ore piles, which can be processed into more material than the raw ore block (at least until you have a GT Crusher or RoC Extractor). While you\u0027re out, right-clicking a hammer on stone will poll the 5x5x5 cube behind it and tell you if there is air, a different stone type, and/or a type of ore it finds.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.crushed",
				"damage": -1
			  },
			  "precision": "FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32713,
		  "amount": 10
		}
	  ]
	},
    {
      "name": "Habilus",
      "description": "You will require more than a wooden box with grid lines and imagination to craft your way out of the copper age. Start with the tools to make more tools. Note that all tools will expend durability with every use, including crafting.",
      "x": 108,
      "y": 125,
      "icon": {
        "id": "gregtech:gt.metatool.01",
		"damage": 18,
		"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
      },
      "prerequisites": [
        "Stop. It\u0027s Time"
      ],
      "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Plates, flat metal",
		  "longDescription": "The Hammer you invented for mineral prospecting and mining is also useful at home. First hammer two copper ingots together, then hammer it flat - now you have a nice flat piece of metal to work with.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.plate",
				"damage": 290
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Your first File",
		  "longDescription": "The File is made from two plates and a stick. It will sharpen things in crafting recipes; currently that is your method of getting a metal rod from the ingot. \n WHile Lead can make tools now, copper is better, and something you will need to fetch anyway. \n\n No idea why this setting is in the pocket multitool, Steve and Alex don\u0027t have fingernails...",
		  "items": [
            {
              "item": {
                "id": "gregtech:gt.metatool.01",
				"damage": 18,
				"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
              },
			  "precision": "NBT_FUZZY"
            }
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Chisel away",
		  "longDescription": "Whether you make the chisel whole cloth, or craft a head and mount it on a stick handle later, you will require a plate and rod of the same metal (copper for now) hammered together and sharpened. \n The chisel is important not only for carving functional and decorative designs in the world, but also for making hollow things in the crafting grid. \n\n Maybe you won\u0027t use this function on the pocket multitool, maybe you will.",
		  "items": [
            {
              "item": {
                "id": "gregtech:gt.metatool.01",
				"damage": 48,
				"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
              },
			  "precision": "NBT_FUZZY"
            }
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Wrenching",
		  "longDescription": "The Wrench rotates most anything, and will assemble a great many crafting recipes. It also connects and disconnects item or fluid pipes from GregTech and those that are Buildcraft compatible. \n No, shift-right clicking doesn\u0027t pick up GT machines -- actually harvest them with the wrench (most will be broken by any pickaxe). \n Six plates hammered in pattern, simple but expensive for the first evening.",
		  "items": [
            {
              "item": {
                "id": "gregtech:gt.metatool.01",
				"damage": 16,
				"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
              },
			  "precision": "NBT_FUZZY"
            }
		  ]
		}
      ],
      "reward": [
        {
          "id": "minecraft:hardened_clay",
		  "amount": 10
        }
      ]
    },
	{
	  "name": "Drawers of Storage",
	  "description": "Whether one chooses the wooden drawers that hold many stacks of a single item per opening, or the metallic Compartment drawers that have a 36 slot chest behind each of their four openings, a wall of either will densely store many things.",
	  "x": 250,
	  "y": 155,
	  "icon": {
	    "id": "StorageDrawers:fullDrawers4"
	  },
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Choose your Drawer",
		  "longDescription": "Later on, you can add a Storage Insterter to semi-automate sorting your loot into the bank of drawers (even a mixed one), but alas only the fully upgraded Drawer Controller can interact with automation systems - and that only sees the connected Storage Drawers.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage":4000
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32713,
		  "amount": 20
		}
	  ]
	},
	{
	  "name": "Metal Smelting",
	  "description": "To smelt most metals, one requires a proper Crucible and a lot of carefully directed heat. The ceramic crucible will remain the best you can make for a while. For now, a solid fueled Burning Box is the best method to heat it.\n Since the crucible produces molten metals when given anything containing them (including ores), it is a great opportunity to cast the metal into a more useful shape using a Mold. Be sure the mold has the correct shape Chiseled into it, as be warned that the freshly poured molten metal is slow to cool - perhaps Pincers would be a good idea. \n The Crucible will recycle any item that hits it, so a Construction Pick will be very helpful for swapping Molds - it puts harvested blocks directly in your inventory.",
	  "x": 150,
	  "y": 150,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 1055
	  },
	  "prerequisites": [
	    "Habilus"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Ceramics",
		  "longDescription": "Be careful how much fuel is put in the burner, as the crucible can melt down if it is mistreated badly. Also, do not touch any part of the device while it is hot. Trace metals left behind from the vapourized sack of mostly water don\u0027t corrupt the metal enough to notice yet - but an appendange doesn\u0027t like having all its water removed quickly.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage":1005
			  },
			  "precision": "NBT_FUZZY"
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 1055
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Stoke the Flames",
		  "longDescription": "Any burning box must be lit with a firestarter after the fuel is put in; and it will continue putting out heat until it can\u0027t grab fuel with air. Use a shovel to remove ashes from the hot box regularly, the fire can choke if the stack overflows. \n Be warned an operational burning box acts like a pool of lava by setting fire to all nearby wooden things.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 1102
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "HardcoreQuesting:hearts",
		  "damage": 3
		}
	  ]
	},
	{
	  "name": "Workshop Tools",
	  "description": "Did you really think only three tools would be required to augment the crafting grid? Silly, try a dozen.",
	  "x": 50,
	  "y": 100,
	  "icon": {
	    "id": "gregtech:gt.metatool.01",
		"damage": 10,
		"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
	  },
	  "prerequisites": [
	    "Habilus"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Tenon Saw",
		  "longDescription": "Not particularly good at chopping down trees, the hand Saw is very good at separating planks. Craft this tool with wood logs to get four planks again, to split planks into sticks, or to chop long rods in twain. Or right-click a log to de-bark it. \n One of the stranger settings to be in the pocket multitool, probably for the wooden block harvesting options.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 10,
				"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Making Curves",
		  "longDescription": "Normally used in conjunction with a HardHammer, the bending cylinders provide hand recipes for rings, curved plates, and springs of their respective size. Other than a couple of clay forming recipes, these tools will be made completely obsolete by a fully stocked machine room during the steam age. \n Good news, since it doesn\u0027t need an edge, nearly any tool material can be used to make these.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 54
			  },
			  "precision": "NBT_FUZZY"
			},
			{
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 56
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.meta.spring",
		  "damage": 8610
		}
	  ]
	},
	{
	  "name": "Making Adjustments",
	  "description": "Some tools are also used to change the settings on various machines. You are likely familiar with using a wrench to toggle pipe connections and rotate blocks; did you know wire connections toggle with Wire Cutters, or that a Monkey Wrench sets the secondary pointing direction for sensors and extenders? Okay, how about setting or re-setting Modes? No, it\u0027s not the wrench...",
	  "x": 100,
	  "y": 185,
	  "icon": {
	    "id": "gregtech:gt.metatool.01",
		"damage": 22,
		"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
	  },
	  "prerequisites": [
	    "Habilus"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Drive them Home",
		  "longDescription": "The Screwdriver is both a very important crafting tool, and well-used to adjust sensor modes. A few other machines respond too, check their tooltips (in NEI if you\u0027ve already built it). \n So useful in fact, this pocket multitool setting should only be used while out adjusting, I recommend you keep a dedicated screwdriver in the A.C.T. for crafting.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 22,
				"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Wire Snips",
		  "longDescription": "Initially used to craft wires (transmission wire from plates, metal thread from foil), these will always be used to set the connections of wires. At least this is an available setting on the pocket multitool.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 26,
				"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Get a Clue",
		  "longDescription": "Sharpen your glass, we need more info. \n The magnifying lens (GT) provides detailed information on the current state of any Gregtech TileEntity - machines, pipes, wires, barrels, etc.. This is the only way to detect how calcified a boiler tank is, or find out which fluid is in a pipe or drum; the fill level of drums and pipes, like the current/voltage in a wire, can also be read and displayed by a sensor rather than polled manually with this insepection lens.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 62
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Bonk!",
		  "longDescription": "The mallet (aka Soft Hammer) makes machines forget. This re-sets all configurations, filters, and modes selected -- it even cancels and voids the current recipe operation.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 14,
				"nbt": "{GT.ToolStats: {a:8221s, c:8221s, j:4000s}}"
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "ImmersiveEngineering:tool",
		  "damage": 2
		}
	  ]
	},
	{
	  "name": "Pottery Works",
	  "description": "Ceramics have been used for liquid containment since the stone age, so you should definately be thinking about using them cave-dweller! \n The measuring cup in particular will continue to be helpful until your forays into chemistry require and provide an acid-resistant upgrade.",
	  "x": 140,
	  "y": 100,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 32740
	  },
	  "prerequisites": [
	    "Gleaning and Foraging",
		"Habilus"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Cutting Controlled",
		  "longDescription": "While a Knife has many uses outdoors, as survival courses can attest, this tool is even better at preparing food -- such as all of Pam\u0027s Cutting Board(tm) recipes.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 34
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Get out of Momma\u0027s Kitchen!",
		  "longDescription": "Mostly used for pizza and pasta, the Rolling Pin also sees use in a potter\u0027s studio.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 46
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Jugs, not Amphorae",
		  "longDescription": "Basically a 2000mB portable tank that won\u0027t connect to pipes. Be warned that meaterial properties apply to all greggy containers; the jug will break if Acidic fluids are poured in, and melt down if the fluid is too hot - above 2000K for ceramic. The porous material simply fails to contain gasses.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
			    "damage": 32740
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Handling fractions",
		  "longDescription": "This cup acts as both a bucket and a 1000mB portable tank; so it is very useful for transfering liquids in Bathing pot or Mixing bowl recipes, or even remote molds if the smelt is cool enough (2000K, it is also ceramic).",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
			    "damage": 32738
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32739,
		  "amount": 2
		}
	  ]
	},
	{
	  "name": "Harvest Time",
	  "description": "These tools are all about improved harvesting, though a few have some crafting uses. A reminder: wrenches _harvest_ GT machines, stop wasting durability inverse-rotating them! \n\n Check out the multi-purpose Universal Spade too.",
	  "x": 50,
	  "y": 15,
	  "icon": {
	    "id": "gregtech:gt.metatool.01",
		"damage": 40,
		"nbt": "{GT.ToolStats: {a:290s, c:8221s, j:25600s}}"
	  },
	  "prerequisites": [
	    "Habilus"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Entomology",
		  "longDescription": "The Scoop tool will properly harvest both hive and bees of all wild Forestry or GregTech varieties, plus capture butterflies should they exist.\n Be very careful when trying to domesticate greggy Bumblebees, they are amazingly easy to kill.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 28
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
	    {
		  "type": "DETECT",
		  "description": "Cleave-Ho!",
		  "longDescription": "While this unwieldy abbatoir appliance isn\u0027t particularly good at combat, it is guaranteed to Loot anything killed by it better than a similarly constructed sword or axe.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 36
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Reaping",
		  "longDescription": "Popularized by the quite similar scythe, the Sense is a wide area crop harvesting tool. Little else to say really.",
		  "items": [
		    {
		      "item": {
			    "id": "gregtech:gt.metatool.01",
			    "damage": 40
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Sheep Scissors",
		  "longDescription": "A variation on vanilla Shears, these scissors are great for shaving Sheep and similar livestock. If one doesn\u0027t need lots of wool, just use this setting on the pocket multitool.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.metatool.01",
				"damage": 64
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Loppers",
		  "longDescription": "The Branch Cutter acts similarly to a Grafter, it gets far more sticks from leaf blocks it harvests.",
		  "items": [
		    {
		      "item": {
			    "id": "gregtech:gt.metatool.01",
			    "damage": 30,
			    "nbt": "{GT.ToolStats: {a:290s, c:8221s, j:6400s}}"
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "minecraft:wool",
		  "damage": 0,
		  "amount": 4
		}
	  ]
	},
	{
	  "name": "Alloying",
	  "description": "Within the crucible of molten metal in a hot Crucible, certain combinations of metals can form close associations if the temperature is high enough. An early and useful example is Bronze. \n With such an improved metal, you can now craft the Pocket Multitool to save on workbench space, and pool the durability of several tools; the wrench is not included.",
	  "x": 192,
	  "y": 125,
	  "icon": {
	    "id": "gregtech:gt.meta.plate",
		"damage": 8610
	  },
	  "bigicon": true,
	  "prerequisites": [
	    "Metal Smelting"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Bronze Age",
		  "longDescription": "Heat a mixture of three parts copper and one part tin to 1357K or higher - this would take 11 smelt units (22 sticks) per set if using crushed native ores with a perfectly efficient invar burning box, more for common ores or lossy burners.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.plate",
				"damage": 8610
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32713,
		  "amount": 10
		}
	  ]
	},
	{
	  "name": "A Pail",
	  "description": "The wooden bucket can only carry cold fluids like milk, water, dirty swamp water, sea water, or lubricant. The Infinite Swamp water and Sea water cannot even be placed back down, so take care what colour the water is -- fresh water doesn\u0027t have infinite minecraft physics in this universe. It is useful for filling your first cauldron though.",
	  "x": 150,
	  "y": 50,
	  "icon": {
	    "id": "gregtech:gt.multiitem.randomtools",
		"damage": 2000
	  },
	  "prerequisites": [
	    "Gleaning and Foraging",
		"Stop. It\u0027s Time"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Banded wood",
		  "longDescription": "You can\u0027t drink from a wooden bucket silly! Use a Cup! \n Right, you\u0027ll need to handle the other fractional fluid amount... perhaps a Measuring Pot?",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.randomtools",
				"damage": 2000
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32739
		},
		{
		  "id": "gregtech:gt.multiitem.randomtools",
		  "damage": 997
		}
	  ]
	},
	{
	  "name": "Ferrous Metal Domination",
	  "description": "Now that you\u0027ve figured out how to run a burning box + crucible, you may have noticed there is no pure iron ore. The ores of iron require \u0027alloying\u0027 with Dark Ashes gathered from burning coal (or lignite coal) in the burning box to form iron. Hematite even requires adding Calcite, from melting down limestone or marble, as a third ingredient.\n\n NEI does have full crucible and crucible alloying support - though there are very very many recycling recipes to scroll through.",
	  "x": 192,
	  "y": 75,
	  "icon": {
	    "id": "minecraft:iron_ingot"
	  },
	  "bigicon": true,
	  "prerequisites": [
	    "Alloying"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Wrought out",
		  "longDescription": "Unless you were very careful with small batches the latter portions of iron you pour will probably be Wrought Iron instead. While it doesn\u0027t work for some applications, this hot forged iron is stronger in GregTechnological settings, and interchangeable for many others.",
		  "items": [
		    {
			  "item": {
			    "id": "Railcraft:part.plate",
				"damage": 0
			  },
			  "precision": "ORE_DICTIONARY",
			  "required": 7
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "minecraft:cauldron"
		}
	  ]
	},
	{
	  "name": "Neolithic Revolution",
	  "description": "Time to bake some bread. Grind seeds into flour, stir in water until viscous, and bake gently. This fully leavened delight presauges the growth of civilisation!",
	  "x": 190,
	  "y": 33,
	  "icon": {
	    "id": "minecraft:bread"
	  },
	  "prerequisites": [
	    "A Pail",
		"Gleaning and Foraging",
		"Ferrous Metal Domination",
		"Pottery Works"
	  ],
	  "parentrequirement": 3,
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Needs babies",
		  "longDescription": "Artificially selected and domesticated grains provide the perfect unborn children to make food out of!",
		  "items": [
		    {
			  "item": {
			    "id": "minecraft:wheat"
			  },
			  "precision": "ORE_DICTIONARY",
			  "required": 3
			}
		  ]
		},
	    {
		  "type": "CRAFT",
		  "description": "Where\u0027s my Pestle?",
		  "longDescription": "The Mortar block is a manual tool. Right-click on the top with an item to grind said item into powder. \nThis is helpful to turn scraps into dust for mixing; and for milling grain to flour.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 32735
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
	    {
		  "type": "CRAFT",
		  "description": "Mixing it all Up",
		  "longDescription": "Related to shapeless recipes, Mixing things together - like powders or liquids - works nicely in this large ceramic bowl.  Be mindful how tiring stirring can be ;)",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 32706
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
	    {
		  "type": "CRAFT",
		  "description": "Bake Gently",
		  "longDescription": "Simple, low temperature baking. Step carefully now, else it will not rise properly.",
		  "items": [
		    {
			  "item": {
			    "id": "minecraft:bread"
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "harvestcraft:toastItem"
		},
		{
		  "id": "gregtech:gt.multiitem.food",
		  "damage": 5001
		},
		{
		  "id": "gregtech:gt.multiitem.food",
		  "damage": 7001
		}
	  ],
	  "rewardchoice": [
	    {
		  "id": "gregtech:gt.meta.dust",
		  "damage": 8620,
		  "amount": 4
		},
		{
		  "id": "gregtech:gt.multiitem.food",
		  "damage": 32003,
		  "amount": 2
		}
	  ]
	},
	{
	  "name": "Washing Dirt",
	  "description": "The crushed ore a hammer gets out of the ground still has a lot of useless stone in it, getting rid of that not only makes crucible operations simpler and safer, sometimes one finds useful impurities. \n Bonus: washed / purified ores smelt for more material than the crushed ore.",
	  "x": 100,
	  "y": 15,
	  "icon": {
	    "id": "minecraft:cauldron"
	  },
	  "prerequisites": [
	    "A Pail",
		"Pottery Works"
	  ],
	  "parentrequirement": 1,
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "By-Products",
		  "longDescription": "There are some materials that can only be obtained by washing ores. While getting those will be easier with a longer production chain, simply washing the crushed ore in a cauldron of water will get some for now.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.crushedPurified",
				"damage": -1
			  },
			  "precision": "FUZZY"
			},
			{
			  "item": {
			    "id": "gregtech:gt.meta.crushedPurifiedTiny",
				"damage": -1
			  },
			  "precision": "FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32713,
		  "amount": 20
		}
	  ]
	},
	{
	  "name": "Juicy",
	  "description": "For when you really need to drink berries. Or use them as dyes, or maybe even extract other liquids from strange plants. It is normally less effective than the Squeezer machine, but one can get more solid rind left over this way.",
	  "x": 110,
	  "y": 167,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 32722
	  },
	  "prerequisites": [
	    "Habilus",
		"Gleaning and Foraging"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "In-World hand tool",
		  "longDescription": "The liquid in the juicer can be plucked out with any bottle, measuring cup, pot, or similar device.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 32722
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "harvestcraft:orangejuiceItem"
		}
	  ]
	},
	{
	  "name": "All the Barrels",
	  "description": "A bank of drawers can handle sorting your bases\u0027s items nicely, but one also needs liquid storage.",
	  "x": 250,
	  "y": 15,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 32714
	  },
	  "prerequisites": [
	    "Baking Bad",
		"Mind the Splinters"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Helpful Crates",
		  "longDescription": "These IE crates are good for travel. The treated wood holds a single chest worth, and keeps it when moved!",
		  "items": [
		    {
			  "item": {
			    "id": "ImmersiveEngineering:woodenDevice",
				"damage": 4
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Liquid Drums",
		  "longDescription": "Jugs are nice for on-hand liquids, but long-term liquid storage is the domain of barrels. Alas, greggy barrels do not naturally interact with buckets / portable tanks, attach the funnel and the tap for that functionality.\n\n By the way, a wooden or rubber mallet (soft hammer) can seal a barrel, casuing fermentation of its contents. Come back occasionally with a magnifying glass to detect when it\u0027s wine, lest you end up finding vinegar when you eventually open it.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 32714
			  },
			  "precision": "ORE_DICTIONARY"
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 32728
			  }
			}
		  ]
		}
	  ],
	  "rewardchoice": [
	    {
		  "id": "gregtech:gt.multiitem.bottles",
		  "damage": 1304,
		  "amount": 3
		},
	    {
		  "id": "gregtech:gt.multiitem.bottles",
		  "damage": 301,
		  "amount": 3
		},
	    {
		  "id": "gregtech:gt.multiitem.bottles",
		  "damage": 501,
		  "amount": 3
		}
	  ]
	},
	{
	  "name": "A. Crafting T.",
	  "description": "The Advanced Crafting Tables are wonderful. The top face has a 16 slot inventory, plus the crafting grid which retains items. Similar to an AE crafting terminal, the grid re-strocks from both internal inventories and all contiguous GregTech Mass Storages. Also, the five top slots can have containers filled or drained by connected pipes. Adding a blueprint to the table makes it act like a single recipe autocrafter. \n\n Further, the front and back faces access an underslung 36 slot chest. \n Screwdriver and Monkey Wrench settings exist for automation features such as an existing item filter.",
	  "x": 50,
	  "y": 185,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 5000
	  },
	  "prerequisites": [
	    "Making Adjustments"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Inexpensive Upgrade",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 5000
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32713,
		  "amount": 10
		}
	  ]
	},
	{
	  "name": "Bird Bath",
	  "description": "This wooden basin will do nicely for low temperature, non-caustic, liquid soaking operations. For now, this means making paper from pulp, sealing wood with various oils, and Mercury density separation. \n\nSome crushed ores can be soaked in liquid mercury to extract Gold, Platinum, Silver, or Zinc from the now-washed ore (consuming the mercury as un-recoverable waste). It is good practice to check NEI on each ore type.",
	  "x": 110,
	  "y": 33,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 32721
	  },
	  "prerequisites": [
	    "A Pail",
		"Pottery Works"
	  ],
	  "parentrequirement": 1,
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Recipe to Soak",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 32721
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "minecraft:paper",
		  "amount": 8
		}
	  ]
	},
	{
	  "name": "Temperature Control",
	  "description": "Given how absolutely crucial temperature is to the operation of a crucible, and how completely necessary using the crucible is, it is a really very good idea to have better control than a calculator and a guess. \n The basis for of control is acutal measurements... \n\n On the subject of measuring and control, there are several other sensors available early game. The Chronometer can command things to happen the same time every minecraft day, to the second. Server politeness can be automated with the Player Counter and TPS Sensors. The Luminometer is a better version of the Daylight Sensor as it is easier to precisely calibrate (but requires a pure silicon plate that will take a Centrifuge to produce); and the Progress sensor that is basically only useful if you have a machine (or monster spawner) with progress to display.",
	  "x": 200,
	  "y": 185,
	  "icon": {
	    "id": "gregtech:gt.multiitem.randomtools",
		"damage": 10000
	  },
	  "prerequisites": [
	    "Alloying",
		"Making Adjustments"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Liquid Mercury",
		  "longDescription": "Liquid quicksilver is required for a full-range thermometer. The magical Shimmerleaf can be juiced or squeezed for it, or simply smelt Cinnabar - the ore of mercury. An empty bottle, like any fluid container, can interact with a hot Crucbile by right-clikcing on the open top, or use a faucet to pour into a Bathing pot or Mixing bowl beneath.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.bottles",
				"damage": 32765
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Handy Thermometer",
		  "longDescription": "The Quicksilver Thermometer can be right-clicked on any block to query the gtTemperature there, without using durability! (Be warned that this is only one of four temperature fields derived from the biome temperature in this pack. The results are effectively meaningless on other mod\u0027s tile entities.)",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.randomtools",
				"damage": 10000
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "CRAFT",
		  "description": "Crucible Safety",
		  "longDescription": "The Thermometer sensor will either display the current gtTemperature of the adjacent block it is pointing to, or emit a redstone signal comparing that temperature to a pre-set limit.  Place it on your crucible, Screwdriver the lower left icon area to cycle modes until the display prefix changes to a greater than sign \u0027\u003e\u0027. With empty hand, press the six buttons to adjust the set point temperature to something above the metling point of your desired alloy, but below the vapour point of anything inside the crucible (and below the crucible\u0027s own failure temperature - for ceramic this is 2500K).",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 31000
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Shutdown Valve",
		  "longDescription": "Use some freestanding Red Alloy wire to carry the signal to a sticky piston that will snuff your burning box\u0027s air supply. Since the box doesn\u0027t care about air until it tries to grab another fuel item, switch to a liquid burner that drinks individual litres multiple times a second. \n Creosote from a bank of automated coke ovens is a valid and useful fuel.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 27000
			  },
			  "required": 2
			},
			{
			  "item": {
			    "id": "minecraft:sticky_piston"
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 1404
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 26020,
		  "amount": 8
		},
		{
		  "id": "HardcoreQuesting:hearts",
		  "damage": 3
		}
	  ]
	},
	{
	  "name": "Wardrobe",
	  "description": "This Locker comes equipped with super-suit-changing features, and zero render lag. \n Do you have any armour, hazmat suit, or robes worth using this with?",
	  "x": 20,
	  "y": 100,
	  "icon": {
	    "id": "BiblioCraft:Armor Stand"
	  },
	  "prerequisites": [
	    "Workshop Tools"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Change Room",
		  "longDescription": "Once you get electronics, this can be upgraded to re-charge the super suit too!",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 7300
			  },
			  "precision": "ORE_DICTIONARY"
			}
		  ]
		}
	  ]
	}
  ],
  "reputationBar": []
}