{
  "name": "Modern Era",
  "description": "Now comes the Age of the Transformers! Full computer control of your highly digitised and automated factory systems paves the way for highly satisfying matter-energy conversion and re-orginization at the sub-atomic level.",
  "quests": [
	{
	  "name": "Alumin-in-inium",
	  "description": "Tired of all that Bauxite pilling up, or just sitting there as a vast taunting mountain? Well, time to show this obnoxiously recalcitrant mineral the path to refined metal.",
	  "x": 60,
	  "y": 100,
	  "icon": {
	    "id": "gregtech:gt.meta.foil",
		"damage": 130
	  },
	  "prerequisites": [
	    "{Electric Revolution}[Electrolysis]",
		"{Chemical Era}[Steamed]",
		"{Chemical Era}[Vitriolic]"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Dedicated Refinery Three",
		  "longDescription": "Getting the Alumina (oxide) out of Bauxite is awfully slow, and almost as complex as Titanium or Tungsten refining was. You may have some Alumina already from Sapphire or Emerald deposits. \n The ground Bauxite Dust needs to be Autoclaved in the presence of Lye - sodium or potassium Hydroxide. The alkali Aluminate is then Bathed in fresh Water to release the catalyst Lye and produce Aluminum triHydroxide. Smelting that finally produces usable Alumina.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 22004
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 22002
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 8008
			  },
			  "required": 17
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Fluor-ed",
		  "longDescription": "Where most ores and compounds can be split into component pure elements by the Electrolyzer, Alumina requires several auxiliary compounds to also be present. Some Coke or Carbon for reduction is unsurprising, but Cryolite and liquid Aluminum Fluoride? \n Well, start by mixing Fluorite dust with Oil of Vitriol to make the glass eating acid. With some of it dissolve glass (or flint) dust, and mix the product with Alumina for the AlF3 which will also need to be melted. Another portion of acid is to be mixed with Alumina and NaOH directly for the Cryolite.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 9215
			  },
			  "required": 2,
			  "precision": "ORE_DICTIONARY"
			},
			{
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 8010
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 8268
			  }
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Finally Refined",
		  "longDescription": "Mix the two solids with a tiny dash of both liquids in your LV Electrolyzer... Voila!",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 130
			  },
			  "required": 2
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 32737
		}
	  ]
	},
    {
	  "name": "Document Printer",
	  "description": "The Guettenburg press in Bibliocraft is perfectly capable of replicating books, even enchanted ones. But without a Scanner (Visuals) and a USB 1 stick to transfer that data, this electric printer can only make Forestry Stamps and Letters or Thaumcraft Jar Labels. \n With the data from a scanner however, it will not only copy books and maps, but recipe Blueprints and Galacticraft Schematics, and put the texture of any block onto some canvas. It will only accept oil-stabilized Chemical Dye, and uses an equal CMYK mix for colour applications.",
	  "x": 20,
	  "y": 130,
	  "icon": {
	    "id": "gregtech:gt.multiitem.randomtools",
		"damage": 7002
	  },
	  "prerequisites": [
	    "Alumin-in-inium",
		"{Electric Revolution}[Dawn of Computing]",
		"{Chemical Era}[Encouraging Motion]"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Copy Print",
		  "longDescription": "Just remember to bind the books afterward. The firmware can print the manual B\u0026W on paper if not given other scan data. \n Image scans definitely fit on a USB 1, large or enchanted books may require tier 2 USB data.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 20271
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 20281
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 32001
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multiitem.technological",
		  "damage": 32001
		}
	  ]
	},
	{
	  "name": "HV String",
	  "description": "Blending Steel with this new Aluminum provides for better RF transmission, unlocking the third and final tier of IE. Now the Arc Furnace and Excavator can run full speed, while the Diesel Engine produces full power. \n This new metal also unlocks the Preheaters for your Advanced Blast Furnace (IE) to further ease Steel automation.",
	  "x": 60,
	  "y": 50,
	  "icon": {
	    "id": "ImmersiveEngineering:metalDevice",
		"damage": 5
	  },
	  "prerequisites": [
	    "Alumin-in-inium",
		"{Electric Revolution}[More RF Power]"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Quality Transmission Line",
		  "longDescription": "With 4096 RF/t transfer rate at each connection, these High Voltage Wires (IE) interface with tier 4 Fluxic gtMachinery; they also work for every other non-nuclear application available. \n Remember that IE wires burn up if more than eight times the connection flux passes through a wire segment, similar to but vastly different from an 8 packet bandwidth.",
		  "items": [
		    {
			  "item": {
			    "id": "ImmersiveEngineering:metalDevice",
				"damage": 7
			  },
			  "precision": "NBT_FUZZY"
			},
			{
			  "item": {
			    "id": "ImmersiveEngineering:metalDevice",
				"damage": 6
			  },
			  "required": 2
			},
			{
			  "item": {
			    "id": "ImmersiveEngineering:metalDevice",
				"damage": 5
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "ImmersiveEngineering:coil",
		  "damage": 2,
		  "amount": 4
		}
	  ]
	},
	{
	  "name": "Programmable Thinking Machines",
	  "description": "Not just flip-flop and conditional, proper LUA 5.2 / 5.3 programming. All ye script kiddies can enjoy Goggling some really kool shiznat about how to run things (like iris control codes). Other folks may try their hand at perfecting other forms of machine, inventory, and world control; possibly consider posting them for others to use and criticise.",
	  "x": 60,
	  "y": 150,
	  "icon": {
	    "id": "OpenComputers:item",
		"damage": 39
	  },
	  "prerequisites": [
	    "Alumin-in-inium",
		"{Chemical Era}[Titanic]",
		"{Electric Revolution}[Dawn of Computing]"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Design-Your-Own",
		  "longDescription": "OpenComputers are wildly modular and customisable, so there are few things to be certain one will require. A CPU, some RAM, a Screen, input Keyboard, and a power supply are about it.",
		  "items": [
		    {
			  "item": {
			    "id": "OpenComputers:item",
				"damage": 27
			  }
			},
		    {
			  "item": {
			    "id": "OpenComputers:item",
				"damage": 28
			  }
			},
		    {
			  "item": {
			    "id": "OpenComputers:item",
				"damage": 20
			  }
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Operatives Abound",
		  "longDescription": "While Redstone signals and direct tile-as-peripheral methods will do many things, many other tasks simply require an in world action. Robots and Drones are the hands of the Computer, though they need to be told what to do via a fixed EEPROM or currently loaded Floppy Disk programmed at a normal Computer or Terminal. \n An Assembler is required to finalize the small parts of such a finely-honed machine. It can also make Tablets for wireless interaction with other OC systems. ",
		  "items": [
		    {
			  "item": {
			    "id": "OpenComputers:assembler"
			  },
			  "precision": "FUZZY"
			},
		    {
			  "item": {
			    "id": "OpenComputers:eeprom"
			  },
			  "precision": "NBT_FUZZY"
			},
		    {
			  "item": {
			    "id": "OpenComputers:item",
				"damage": 109
			  }
			},
		    {
			  "item": {
			    "id": "OpenComputers:item",
				"damage": 4
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "OpenComputers:item",
		  "damage": 33,
		  "amount": 2
		}
	  ]
	},
	{
	  "name": "More Volts!",
	  "description": "As we now have the correct casing material for MV (GT) machinery, we can use transformers to interchange the higher tiers of electrically powered machines. Electrical machines follow the same power tiering mechanics as heat, rotation, and oscillation kinetic machines do; the ability to transform electricity into a different tier after generation provides many opportunities. \n Electric machines that contain chips have a minimum chip tier equal to their power tier (1 - LV to 5 - IV). The Ultimate tier 6 chips are for multiblocks and specialty purposes.",
	  "x": 160,
	  "y": 100,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 10044
	  },
	  "prerequisites": [
	    "Alumin-in-inium"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Step Along Now",
		  "longDescription": "You may have used the ULV transformer for a Solar Panel power system. The same mechanics apply to the other seven transformer tiers, which are very useful for centralizing power production at a plant; the higher ones will be necessary to achieve voltages above that of the power plant components.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 10041
			  },
			  "precision": "NBT_FUZZY"
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 10042
		}
	  ]
	},
	{
	  "name": "Enhanced Lasers",
	  "description": "Much like the T1 Laser Engraver showed great value in constructing better Circuit Boards, T2 and T3 will provide new recipes important for continued progression. \n See also the Bumblyzers and Plantalyzers for breeding program assistance. \n\n A tiered up Crystalyzation Crucible can make Sapphire boules of any colour (including real Rubies) simply by doping liquid Alumina with a metal dust; cutting the boule produces Ruby and Sapphire Crystalline Plates. The Implosion Compressor multiblock (which takes crystal processors) can turn Emerald and Diamond dusts back into gems, which can also be cut into crystalline plates.",
	  "x": 260,
	  "y": 100,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 20323
	  },
	  "prerequisites": [
	    "More Volts!",
		"{Electric Revolution}[Advanced Circuitry]"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Few are Required",
		  "longDescription": "In terms of progression stoppers, the tier 3 Laser Engraver is the highest point; it is the only way to create AE2 presses from scratch. However, the tier 2 Laser Engraver can do; when perfectly overclocked it is able to produce crystal processors from Ruby, Emerald, Sapphire, and Diamond Crystalline Plates. \n Remember that LU produced are only half the EU put into the laser. However, the battery trick can be used to step-up laser pulse intensity, instead of using a massive Electric Laser Emitter (capable of continuous emission). However these Crystal Chargers require storage Emerald Processors in addition to tiered normal Chips.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 20322
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multiitem.technological",
		  "damage": 30500
		}
	  ]
	},
	{
	  "name": "Black Up",
	  "description": "Raising the voltage on your Electrolyzer adds many molecular decomposition recipes. Hidden amoung them is the production of your next economical tool material.",
	  "x": 160,
	  "y": 50,
	  "icon": {
	    "id": "gregtech:gt.meta.toolHeadPickaxe",
		"damage": 8003
	  },
	  "prerequisites": [
	    "{Electric Revolution}[Electrolysis]",
		"More Volts!"
	  ],
	  "tasks": [
		{
		  "type": "DETECT",
		  "description": "Super, Cheap, Tools",
		  "longDescription": "Carborundum, Moh scale 9, is a beautiful material to make mining and crafting tools out of. It just took MV Electrolysis to make some, from remarkably renewable and cheap components.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.toolHeadPickaxe",
				"damage": 8003
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.meta.dust",
		  "damage": 8103,
		  "amount": 6
		}
	  ]
	},
	{
	  "name": "Carbon Fibre",
	  "description": "Shuffle around some common carbon atoms with molecular tweezers and you get a really good working material. This nanofab makes Carbon Crucibles and Graphene wire. Alas it took a Sapphire Conversion Circuit to run.",
	  "x": 220,
	  "y": 70,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 20443
	  },
	  "prerequisites": [
	    "Enhanced Lasers"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Tiny fabrication",
		  "longDescription": "Select which form the pure carbon dust should take, and go! Sugar carbonizes really well with sulphuric acid.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 30504
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 30306
			  },
			  "required": 2
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 11004
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 11003
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 11005
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregapi:gt.integrated_circuit",
		  "amount": 4
		}
	  ]
	},
	{
	  "name": "Massive Power",
	  "description": "Using these multi-block structures will provide a higher efficiency steam power plant than using lots of the single-block parts; you will get an entire 12 EU per 24 HU fed in. You will need to put 4096 nominal HU/t into the eight Heat acceptors, and be able to receive either 3072 RU/t or 2048 EU/t nominal (EV) at the output. Some steam sharing is possible since the Turbine accepts steam from 21 faces. \n One could also tap into the efficiency of the main Dynamo by up-gearing an array of small turbines with a pattern of Gearboxes. Or by using the new Gas Turbine to get better energy density out of seven specific gasseous fuels and skip the steam conversion step entirely.",
	  "x": 160,
	  "y": 150,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 17221
	  },
	  "prerequisites": [
	    "{Electric Revolution}[Advanced Circuitry]",
		"More Volts!"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Semi-Ultimate Steam Power",
		  "longDescription": "There are three tiers of power plant above this, but they require specialized burning boxes. \n Build instructions are in the tooltips; place the ring of Heat Acceptors on the bottom of the Boiler tower, the steam exits from the centre of all five boiler faces. The steam enters a Stainless Steel Wall disk, flanking a block of Magnalium Plate Blocks (magnesium - aluminium alloy) with the Turbine Main Housing. That single face outputs directly into the Dynamo Wall disk flanking some Large annealed Copper Coil blocks. ",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17205
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17211
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17221
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18101
			  },
			  "required": 9
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18027
			  },
			  "required": 25
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18022
			  },
			  "required": 52
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18040
			  },
			  "required": 18
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.multitileentity",
		  "damage": 14044,
		  "amount": 2
		}
	  ]
	},
	{
	  "name": "Ultra-sliced",
	  "description": "Now for (nearly) lossless cutting of Diamond Plates. Really helpful for utilizing those industrial Diamonds from compressors. Making any Shredder beforehand was rather expensive, for a pure recycling machine.",
	  "x": 20,
	  "y": 70,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 20014
	  },
	  "prerequisites": [
	    "Alumin-in-inium"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Hard Enough Blades",
		  "longDescription": "Cobalt Brass is not a simple alloy like Bronze, but it has the required properties for a buzzsaw that slices Diamonds. Remember to use Lubricant in the Cutter machine itself.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.toolHeadBuzzSaw",
				"damage": 8621
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.meta.plateGem",
		  "damage": 8300,
		  "amount": 2
		}
	  ]
	},
	{
	  "name": "Quantum Replication",
	  "description": "A far cry from UUMatter, a Matter Fabricator spends QU to break objects down into a mixture of Charged and Neutral Plasma. Pipe both plasmas (preferably by direct connection or with Logistics Tanks) into a Matter Replicator containing the scan data for some other elemental, or select molecular, material and apply more QU. \n Quantum power Units? This requires applying Laser energy Units to a Quantum Energizer. Naturally this conversion halves the energy flow.\n Note that both these machines\u0027 efficiency is tier dependent, only the T5 versions and the multiblock run without loss. Lacking both tier power cost multipliers and minimum power requirements, these machines actually use less total energy at high tier. \n All QU machines have Osmiridium as a major component. The alloy of two Platinum-group metals, this is awfully difficult to produce at scale; remember how bad tiering up the Crystalyzation Crucible was?",
	  "x": 260,
	  "y": 150,
	  "icon": {
	    "id": "gregtech:gt.meta.machine",
		"damage": 8682
	  },
	  "prerequisites": [
	    "Enhanced Lasers"
	  ],
	  "tasks": [
	    {
		  "type": "CRAFT",
		  "description": "Destructive Testing",
		  "longDescription": "Sacrifice an item to attempt to read its molecular make-up in this sub-atomic Scanner. You will require a T3 (or T4) USB or HDD to store the data. This part takes and requires specifically tier 3 QU power, and is awfully slow. \n By the way, this molecular scan data can be printed into a Material Dictionary book by the Printer.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 20423
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 10123
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.meta.machine",
				"damage": 8682
			  },
			  "required": 2
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Data Selection",
		  "longDescription": "Rather than replacing the USB3 Stick in the Scanner or Replicator, use a USB Switch or HDD Switch block and this USB data Cable. Unfortunately it\u0027s a very short cable, and will only connect to an adjacent block. Which one of the sixteen (virtual) data slots to use is chosen by a Selector cover. For creating material in the Replicator, the temporary selection of a Button Panel with auto-reset mode screwed in can be very nice (leave data slot 0 empty for standby mode). A sticky button panel is equivalent to a Manual Selector cover.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multiitem.technological",
				"damage": 32013
			  }
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.meta.ingot",
		  "damage": 8682,
		  "amount": 8
		}
	  ]
	},
	{
	  "name": "Eternal Mines",
	  "description": "From beneath the Bedrock comes endless mineral wealth. However only in certain spots; in some biomes they are easy to spot by indicator plants, otherwise one must look for a hollow in the Bedrock interface, generally filled with an out-of-place lump of equivalent common ore.",
	  "x": 300,
	  "y": 70,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 18103
	  },
	  "prerequisites": [
	    "Enhanced Lasers",
		"{Chemical Era}[Titanic]",
		"{Chemical Era}[Carbide]"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Heavy Bore",
		  "longDescription": "Rather a lot of Titanium goes into this device, not to mention the TungstenSteel. At least it has four inputs that accept 1024 to 4096 RU/t each. Find a way to input Lubricant. Items will come out the main block in the top, including the occasional Impure Bedrock Dust - the expected source of Adamantium.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17999
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18026
			  },
			  "required": 35
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18103
			  },
			  "required": 9
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.meta.dustImpure",
		  "damage": 8599,
		  "amount": 9
		}
	  ]
	},
	{
	  "name": "Adam Man",
	  "description": "Less magical than Draconium, or even Bedrock-Steel Alloy, Adamantium is also a massively overpowered metal in its own way. It is also immensely rarer than either of those other two are supposed to be.",
	  "x": 300,
	  "y": 40,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 32618
	  },
	  "prerequisites": [
	    "Eternal Mines"
	  ],
	  "tasks": [
	    {
		  "type": "DETECT",
		  "description": "Ultimate Rust",
		  "longDescription": "Magnetically separate Adamantine from that Impure Bedrock Dust; even though an oxide, it is an extremely powerful tool material. Alas it needs to be purified before it becomes useful for pipes and tanks.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.dustTiny",
				"damage": 8784
			  }
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "The Best, Supposedly",
		  "longDescription": "Acid-safe, outrageously high-temperature, highly blast resistant, touch-safe, and with massive Capacity, Adamantium is possibly the platinum standard of pipe and tank material. Did I mention it is also plasma safe? A very rare quality that.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 2220
			  }
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Seriously, ...",
		  "longDescription": "If you found some Animey-ese while prospecting for IE Extractor veins, there will be a tiny amount of Vibranium in it. Yes, that Marvel stuff. Alloy it for the insane Item Pipe and Turbine material: Vibramantium! \n Alternately, once you get a Fusion Reactor up and running, Adamantium can be converted into Vibranium by the addition of Be-7. \n\n This will earn you other-worldly contacts, willing to support your creation of divine tools and machines.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.meta.dust",
				"damage": 8706
			  }
			}
		  ]
		}
	  ],
	  "repeat": {
	    "type": "TIME",
		"days": 8,
		"hours": 0
	  },
      "rewardchoice": [
	    {
		  "id": "gregtech:gt.meta.dust",
		  "damage": 2220
		},
		{
		  "id": "gregtech:gt.meta.dustSmall",
		  "damage": 1520
		},
		{
		  "id": "minecraft:potion",
		  "damage": 8257,
		  "amount": 8
		},
		{
		  "id": "minecraft:golden_apple",
		  "damage": 1
		}
	  ]
	},
	{
	  "name": "Master Machines",
	  "description": "Every step in common ore processing, and the Bauxite chain, has a corresponding multiblock machine. Unlike mundane single-block machines, they do not suffer from overclocking (tiering) penalties to power consumption. They thus get away with being tier 3.5 machines and yet being faster then the tier 4 machine for all but the hardest recipes. Furthermore, they have 16, 64, or 256 threads to do recipes in parallel, making them very power efficient and super fast. Too bad they all take etched gem Crystal Processors.",
	  "x": 260,
	  "y": 50,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 20084
	  },
	  "prerequisites": [
	    "Enhanced Lasers",
		"{Chemical Era}[Extra Crispy]"
	  ],
	  "tasks": [
		{
		  "type": "DETECT",
		  "description": "Crush it all!",
		  "longDescription": "The perfect gizzard. Just don\u0027t stand on it unless you want to be chewed up too.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17108
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18107
			  },
			  "required": 18
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18003
			  },
			  "required": 56
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Ore wash the world",
		  "longDescription": "Operating the Large Sluice can be finicky. The ores must enter the three sluice parts on top at the back. Water can only be piped into those same eight faces. The controller and the two blocks flanking it at the front bottom are the only place washed ore and sluice juice can be piped out from; only the controller itself can auto-output. The RU must be input at the driving spot on either side near the back.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17107
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18106
			  },
			  "required": 21
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18006
			  },
			  "required": 41
			}
		  ]
		},
	    {
		  "type": "DETECT",
		  "description": "So much Centrifuge",
		  "longDescription": "Hence the need for extra strong TungstenSteel throughout.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17100
			  }
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18100
			  },
			  "required": 17
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Shred it",
		  "longDescription": "Whether you have needless piles of junk, or just need to turn a truly enormous amount of purified ore into dust, this frightening array of spinning diamond edged blades will do the trick.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17109
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18108
			  },
			  "required": 18
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18003
			  },
			  "required": 56
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Sauna for everyone",
		  "longDescription": "Somebody might need this many pure certus or pure fluix crystals. Everybody will want this amount of bauxite processing.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17112
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18002
			  },
			  "required": 49
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Gotta soak them all",
		  "longDescription": "The Large Bathing Vat handles enormous amounts of material sitting around getting soaked. Perfect for Aluminium.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17104
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18002
			  },
			  "required": 49
			}
		  ]
		},
		{
		  "type": "DETECT",
		  "description": "Separate Everything",
		  "longDescription": "For when lots of stuff needs to be shocked, only the Large Electrolyzer will do.",
		  "items": [
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 17103
			  }
			},
		    {
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 18105
			  },
			  "required": 17
			}
		  ]
		}
	  ],
	  "reward": [
	    {
		  "id": "gregtech:gt.meta.dust",
		  "damage": 9100,
		  "amount": 18
		}
	  ]
	},
	{
	  "name": "Fissibles",
	  "description": "How about some GT6 nuclear Fission? The neutron flow is being simulated only in the two horizontal directions, which leaves the top face for manual rod intervention. Thankfully a bank of Reactor Cores (both 2x2 and 1x1 or mixed) shares Coolant and Heatant reservoirs across. Things will get dicey if the Coolant gets low. Things get vapourized should the coolant run out entirely, or if the Heatant clogs up. \n Be aware that Heatant is considered a Power-Conducting-Fluid like steam, and cannot be buffered or stored in greggy tanks or barrels.",
	  "x": 220,
	  "y": 130,
	  "icon": {
	    "id": "gregtech:gt.multitileentity",
		"damage": 9241
	  },
	  "prerequisites": [
	    "Enhanced Lasers"
	  ],
	  "tasks": [
	  {
	    "type": "DETECT",
		"description": "Neutron Boxes",
		"longDescription": "The Rods in these cores will send and receive virtual neutrons on the half-grid of attached cores. Fill each zirconium reactor rod with a rod of a radioactive isotope, Cd-In-Ag absorber, or beryllium reflector. Pincers will be required to insert and extract the rods. A radiation suit would be well advised also.",
		"items": [
		  {
		    "item": {
			  "id": "gregtech:gt.multitileentity",
			  "damage": 9200
			},
			{
			  "item": {
			    "id": "gregtech:gt.multitileentity",
				"damage": 9201
			  },
			  "required": 4
			}
		  }
		]
	  },
	  {
	    "type": "DETECT",
		"description": "Getting the power out",
		"longDescription": "For this reactor type, the desirable output is liquid Heatant - liquid Coolant that has been pumped full of thermal energy. These Liquid Heat Exchangers will cool the Heatant back into Coolant when fed with some water that it turns into Steam. \n It can also cool Lava into Pahoehoe to make less steam slowly.",
		"items": [
		  {
		    "item": {
			  "id": "gregtech:gt.multitileentity",
			  "damage": 9103
			},
			"precision": "ORE_DICTIONARY"
		  }
		]
	  }
	  ]
	}
  ],
  "reputationBar": []
}